gezegenler/app/Models/PanelModel.php

    public function veri_ekle($baslik,$url,$icerik,$resim){
        $builder = $this->db->table('gezegenler');

        $data=[
            'baslik'=>$baslik,
            'url'=>$url,
            'icerik'=>$icerik,
            'resim'=>$resim,
        ];

        return $builder->insert($data);
---
INSERT INTO `gezegenler` (`baslik`, `url`, `icerik`, `resim`) VALUES ('test', 'test', 'ragr', '1704971159_7d1046b68bcc38b81a37.png')